RT-Thread/rt-thread/bsp/efm32/Libraries/CMSIS/CM3/DeviceSupport/EnergyMicro/EFM32/efm32tg840f32.h
/** Flash and SRAM limits for EFM32TG840F32 */
#define FLASH_BASE           (0x00000000UL) /**< Flash Base Address */
#define FLASH_SIZE           (0x00008000UL) /**< Available Flash Memory */
#define SRAM_BASE            (0x20000000UL) /**< SRAM Base Address */
#define SRAM_SIZE            (0x00001000UL) /**< Available SRAM Memory */
#define __CM3_REV            0x201          /**< Cortex-M3 Core revision r2p1 */
#define PRS_CHAN_COUNT       8              /**< Number of PRS channels */
#define DMA_CHAN_COUNT       8              /**< Number of DMA channels */

/* Part number capabilities */

#define TIMER_PRESENT        /**< TIMER is available in this part */
#define TIMER_COUNT        2 /**< 2 TIMERs available  */
#define USART_PRESENT        /**< USART is available in this part */
#define USART_COUNT        2 /**< 2 USARTs available  */
#define LEUART_PRESENT       /**< LEUART is available in this part */
#define LEUART_COUNT       1 /**< 1 LEUARTs available  */
#define LETIMER_PRESENT      /**< LETIMER is available in this part */
#define LETIMER_COUNT      1 /**< 1 LETIMERs available  */
#define PCNT_PRESENT         /**< PCNT is available in this part */
#define PCNT_COUNT         1 /**< 1 PCNTs available  */
#define I2C_PRESENT          /**< I2C is available in this part */
#define I2C_COUNT          1 /**< 1 I2Cs available  */
#define ADC_PRESENT          /**< ADC is available in this part */
#define ADC_COUNT          1 /**< 1 ADCs available  */
#define DAC_PRESENT          /**< DAC is available in this part */
#define DAC_COUNT          1 /**< 1 DACs available  */
#define ACMP_PRESENT         /**< ACMP is available in this part */
#define ACMP_COUNT         2 /**< 2 ACMPs available  */
#define LE_PRESENT
#define LE_COUNT           1
#define MSC_PRESENT
#define MSC_COUNT          1
#define EMU_PRESENT
#define EMU_COUNT          1
#define RMU_PRESENT
#define RMU_COUNT          1
#define CMU_PRESENT
#define CMU_COUNT          1
#define AES_PRESENT
#define AES_COUNT          1
#define LESENSE_PRESENT
#define LESENSE_COUNT      1
#define GPIO_PRESENT
#define GPIO_COUNT         1
#define PRS_PRESENT
#define PRS_COUNT          1
#define DMA_PRESENT
#define DMA_COUNT          1
#define OPAMP_PRESENT
#define OPAMP_COUNT        1
#define VCMP_PRESENT
#define VCMP_COUNT         1
#define LCD_PRESENT
#define LCD_COUNT          1
#define RTC_PRESENT
#define RTC_COUNT          1
#define HFXTAL_PRESENT
#define HFXTAL_COUNT       1
#define LFXTAL_PRESENT
#define LFXTAL_COUNT       1
#define WDOG_PRESENT
#define WDOG_COUNT         1
#define DBG_PRESENT
#define DBG_COUNT          1

#include "core_cm3.h"     /* Cortex-M3 processor and core peripherals */
#include "system_efm32.h" /* System Header */

/** @} End of group EFM32TG840F32_Part */

/**************************************************************************//**
 * @defgroup EFM32TG840F32_Peripheral_TypeDefs EFM32TG840F32 Peripheral TypeDefs
 * @{
 * @brief Device Specific Peripheral Register Structures
 *****************************************************************************/

/**************************************************************************//**
 * @defgroup EFM32TG840F32_MSC EFM32TG840F32 MSC
 * @brief EFM32TG840F32_MSC Register Declaration
 * @{
 *****************************************************************************/
typedef struct
{
  __IO uint32_t CTRL;         /**< Memory System Control Register  */
  __IO uint32_t READCTRL;     /**< Read Control Register  */
  __IO uint32_t WRITECTRL;    /**< Write Control Register  */
  __IO uint32_t WRITECMD;     /**< Write Command Register  */
  __IO uint32_t ADDRB;        /**< Page Erase/Write Address Buffer  */

  uint32_t      RESERVED0[1]; /**< Reserved for future use **/
  __IO uint32_t WDATA;        /**< Write Data Register  */
  __I uint32_t  STATUS;       /**< Status Register  */

  uint32_t      RESERVED1[3]; /**< Reserved for future use **/
  __I uint32_t  IF;           /**< Interrupt Flag Register  */
  __IO uint32_t IFS;          /**< Interrupt Flag Set Register  */
  __IO uint32_t IFC;          /**< Interrupt Flag Clear Register  */
  __IO uint32_t IEN;          /**< Interrupt Enable Register  */
  __IO uint32_t LOCK;         /**< Configuration Lock Register  */
  __IO uint32_t CMD;          /**< Command Register  */
  __I uint32_t  CACHEHITS;    /**< Cache Hits Performance Counter  */
  __I uint32_t  CACHEMISSES;  /**< Cache Misses Performance Counter  */
  uint32_t      RESERVED2[1]; /**< Reserved for future use **/
  __IO uint32_t TIMEBASE;     /**< Flash Write and Erase Timebase  */
} MSC_TypeDef;                /** @} */

/**************************************************************************//**
 * @defgroup EFM32TG840F32_EMU EFM32TG840F32 EMU
 * @brief EFM32TG840F32_EMU Register Declaration
 * @{
 *****************************************************************************/
typedef struct
{
  __IO uint32_t CTRL;         /**< Control Register  */

  uint32_t      RESERVED0[1]; /**< Reserved for future use **/
  __IO uint32_t LOCK;         /**< Configuration Lock Register  */

  uint32_t      RESERVED1[6]; /**< Reserved for future use **/
  __IO uint32_t AUXCTRL;      /**< Auxiliary Control Register  */
} EMU_TypeDef;                /** @} */

/**************************************************************************//**
 * @defgroup EFM32TG840F32_RMU EFM32TG840F32 RMU
 * @brief EFM32TG840F32_RMU Register Declaration
 * @{
 *****************************************************************************/
typedef struct
{
  __IO uint32_t CTRL;     /**< Control Register  */
  __I uint32_t  RSTCAUSE; /**< Reset Cause Register  */
  __O uint32_t  CMD;      /**< Command Register  */
} RMU_TypeDef;            /** @} */

/**************************************************************************//**
 * @defgroup EFM32TG840F32_CMU EFM32TG840F32 CMU
 * @brief EFM32TG840F32_CMU Register Declaration
 * @{
 *****************************************************************************/
typedef struct
{
  __IO uint32_t CTRL;         /**< CMU Control Register  */
  __IO uint32_t HFCORECLKDIV; /**< High Frequency Core Clock Division Register  */
  __IO uint32_t HFPERCLKDIV;  /**< High Frequency Peripheral Clock Division Register  */
  __IO uint32_t HFRCOCTRL;    /**< HFRCO Control Register  */
  __IO uint32_t LFRCOCTRL;    /**< LFRCO Control Register  */
  __IO uint32_t AUXHFRCOCTRL; /**< AUXHFRCO Control Register  */
  __IO uint32_t CALCTRL;      /**< Calibration Control Register  */
  __IO uint32_t CALCNT;       /**< Calibration Counter Register  */
  __IO uint32_t OSCENCMD;     /**< Oscillator Enable/Disable Command Register  */
  __IO uint32_t CMD;          /**< Command Register  */
  __IO uint32_t LFCLKSEL;     /**< Low Frequency Clock Select Register  */
  __I uint32_t  STATUS;       /**< Status Register  */
  __I uint32_t  IF;           /**< Interrupt Flag Register  */
  __IO uint32_t IFS;          /**< Interrupt Flag Set Register  */
  __IO uint32_t IFC;          /**< Interrupt Flag Clear Register  */
  __IO uint32_t IEN;          /**< Interrupt Enable Register  */
  __IO uint32_t HFCORECLKEN0; /**< High Frequency Core Clock Enable Register 0  */
  __IO uint32_t HFPERCLKEN0;  /**< High Frequency Peripheral Clock Enable Register 0  */
  uint32_t      RESERVED0[2]; /**< Reserved for future use **/
  __I uint32_t  SYNCBUSY;     /**< Synchronization Busy Register  */
  __IO uint32_t FREEZE;       /**< Freeze Register  */
  __IO uint32_t LFACLKEN0;    /**< Low Frequency A Clock Enable Register 0  (Async Reg)  */
  uint32_t      RESERVED1[1]; /**< Reserved for future use **/
  __IO uint32_t LFBCLKEN0;    /**< Low Frequency B Clock Enable Register 0 (Async Reg)  */
  uint32_t      RESERVED2[1]; /**< Reserved for future use **/
  __IO uint32_t LFAPRESC0;    /**< Low Frequency A Prescaler Register 0 (Async Reg)  */
  uint32_t      RESERVED3[1]; /**< Reserved for future use **/
  __IO uint32_t LFBPRESC0;    /**< Low Frequency B Prescaler Register 0  (Async Reg)  */
  uint32_t      RESERVED4[1]; /**< Reserved for future use **/
  __IO uint32_t PCNTCTRL;     /**< PCNT Control Register  */
  __IO uint32_t LCDCTRL;      /**< LCD Control Register  */
  __IO uint32_t ROUTE;        /**< I/O Routing Register  */
  __IO uint32_t LOCK;         /**< Configuration Lock Register  */
} CMU_TypeDef;                /** @} */

/**************************************************************************//**
 * @defgroup EFM32TG840F32_AES EFM32TG840F32 AES
 * @brief EFM32TG840F32_AES Register Declaration
 * @{
 *****************************************************************************/
typedef struct
{
  __IO uint32_t CTRL;         /**< Control Register  */
  __IO uint32_t CMD;          /**< Command Register  */
  __I uint32_t  STATUS;       /**< Status Register  */
  __IO uint32_t IEN;          /**< Interrupt Enable Register  */
  __I uint32_t  IF;           /**< Interrupt Flag Register  */
  __IO uint32_t IFS;          /**< Interrupt Flag Set Register  */
  __IO uint32_t IFC;          /**< Interrupt Flag Clear Register  */
  __IO uint32_t DATA;         /**< DATA Register  */
  __IO uint32_t XORDATA;      /**< XORDATA Register  */
  uint32_t      RESERVED0[3]; /**< Reserved for future use **/
  __IO uint32_t KEYLA;        /**< KEY Low Register  */
  __IO uint32_t KEYLB;        /**< KEY Low Register  */
  __IO uint32_t KEYLC;        /**< KEY Low Register  */
  __IO uint32_t KEYLD;        /**< KEY Low Register  */
  __IO uint32_t KEYHA;        /**< KEY High Register  */
  __IO uint32_t KEYHB;        /**< KEY High Register  */
  __IO uint32_t KEYHC;        /**< KEY High Register  */
  __IO uint32_t KEYHD;        /**< KEY High Register  */
} AES_TypeDef;                /** @} */

/**************************************************************************//**
 * @brief LESENSE_ST EFM32TG840F32 LESENSE ST
 *****************************************************************************/
typedef struct
{
  __IO uint32_t TCONFA; /**< State transition configuration A  */
  __IO uint32_t TCONFB; /**< State transition configuration B  */
} LESENSE_ST_TypeDef;
/**************************************************************************//**
 * @brief LESENSE_BUF EFM32TG840F32 LESENSE BUF
 *****************************************************************************/
typedef struct
{
  __IO uint32_t DATA; /**< Scan results  */
} LESENSE_BUF_TypeDef;
/**************************************************************************//**
 * @brief LESENSE_CH EFM32TG840F32 LESENSE CH
 *****************************************************************************/
typedef struct
{
  __IO uint32_t TIMING;       /**< Scan configuration  */
  __IO uint32_t INTERACT;     /**< Scan configuration  */
  __IO uint32_t EVAL;         /**< Scan configuration  */

  uint32_t      RESERVED0[1]; /**< Reserved future */
} LESENSE_CH_TypeDef;

/**************************************************************************//**
 * @defgroup EFM32TG840F32_LESENSE EFM32TG840F32 LESENSE
 * @brief EFM32TG840F32_LESENSE Register Declaration
 * @{
 *****************************************************************************/
typedef struct
{
  __IO uint32_t       CTRL;           /**< Control Register  */
  __IO uint32_t       TIMCTRL;        /**< Timing Control Register  */
  __IO uint32_t       PERCTRL;        /**< Peripheral Control Register  */
  __IO uint32_t       DECCTRL;        /**< Decoder control Register  */
  __IO uint32_t       BIASCTRL;       /**< Bias Control Register  */
  __IO uint32_t       CMD;            /**< Command Register  */
  __IO uint32_t       CHEN;           /**< Channel enable Register  */
  __I uint32_t        SCANRES;        /**< Scan result register  */
  __I uint32_t        STATUS;         /**< Status Register  */
  __I uint32_t        PTR;            /**< Result buffer pointers  */
  __I uint32_t        BUFDATA;        /**< Result buffer data register  */
  __I uint32_t        CURCH;          /**< Current channel index  */
  __IO uint32_t       DECSTATE;       /**< Current decoder state  */
  __IO uint32_t       SENSORSTATE;    /**< Decoder input register  */
  __IO uint32_t       IDLECONF;       /**< GPIO Idlephase configuration  */
  __IO uint32_t       ALTEXCONF;      /**< Alternative excite pin configuration  */
  __I uint32_t        IF;             /**< Interrupt Flag Register  */
  __IO uint32_t       IFC;            /**< Interrupt Flag Clear Register  */
  __IO uint32_t       IFS;            /**< Interrupt Flag Set Register  */
  __IO uint32_t       IEN;            /**< Interrupt Enable Register  */
  __I uint32_t        SYNCBUSY;       /**< Synchronization Busy Register  */
  __IO uint32_t       ROUTE;          /**< I/O Routing Register  */
  __IO uint32_t       POWERDOWN;      /**< LESENSE RAM power-down resgister  */

